Autodesk.Revit.DB.Structure.SteelElementRegenChangeType
Remarks:
type of the cell change
type of the object
Since:
2019

Autodesk.Revit.DB.Structure.SteelElementRegenChangeType.Hard
means big change that may affect other elements as well, for example move

Autodesk.Revit.DB.Structure.SteelElementRegenChangeType.Graphics
Means small change affecting only this element, for example a new feature was added
From Revit point of view element should be redrawn

Autodesk.Revit.DB.Structure.SteelElementRegenChangeType.Touch
Means undefined change in this element's outside data.
From Revit point of view element should be marked as changed and checked-out if appropriate